# 2. Представлен список чисел. Необходимо вывести элементы
# исходного списка, значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка.
# Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

from random import randint
some_vars = [randint(0, 500) for i in range(14)]

# =========================================without zip
print(f'{some_vars}\n{[k for k in some_vars[1:] if k > some_vars[some_vars.index(k)-1]]}')

# ==========================================with zip
# print(f'{some_vars}\n{[m for k, m in zip(some_vars, some_vars[1:]) if m > k]}')
